Revit 2027 API
SelectionFilterElement.RemoveSingle Method
 Removes a single ElementId from the filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSingle(
	ElementId id
)
Public Sub RemoveSingle (
	id As ElementId
)
public:
void RemoveSingle(
	ElementId^ id
)
member RemoveSingle :
        id : ElementId -> unit
Parameters
id ElementId
 The ElementId to remove.
Exceptions
Exception | Condition
ArgumentException |  Invalid ElementId
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace